# MYSQL Database Creation
**Author:** Michael McCann <br>
**Last Updated:** 13 May 2022


<u>Overview:</u> <br>
With data collection from IMDB and TMDB complete we need to load the data into MySQL and create a relational databases for access and use with SQL. 

<u>Tasks:</u><br> 
- Load in our CSVs 
- Normalize Data
- Select Columns
- Create Schema
- Create SQL Table and Read in Data

<u>Other:</u><br>
NA

## Imports

In [1]:
import pandas as pd
import numpy as np
import json

import pymysql
from sqlalchemy import create_engine
from sqlalchemy.types import*
from sqlalchemy_utils import create_database, database_exists

# Create Database

In [2]:
# Load SQL creds
with open('../../.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['user', 'password'])

## Create Connection to MYSQL

In [3]:
# create connection
database = "movieDB"
conn = f"mysql+pymysql://{login['user']}:{login['password']}@localhost/{database}"

# create engine
engine = create_engine(conn)

## Create Database

In [4]:
# Create Database (and check to make sure you don't overwrite)
if database_exists(conn) == False:
    create_database(conn)
else:
    print('the database already exists')

the database already exists

# Create SQL Tables

## title_basics

### Read In and Inspect Data

In [5]:
basics = pd.read_csv("data/title_basics.csv.gz")

display(basics.head(2))

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama

In [6]:
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]

### Normalize Genres Column

In [7]:
genres_split = basics['genres'].str.split(',')
unique_genres = sorted(genres_split.explode().unique())

In [8]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
# Save out exploded_genres to create title_genre later
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
79183,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
79183,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
79183,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
79184,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
79184,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

Eliminate extra columns from title_basics.
- 'oroginalTitle': duplicitive with the actual title.
- 'titleType': All movies. 
- 'genres' and 'genres_split': are now captured in our genre table.
- 'isAdult': is a genre as well

In [10]:
# Clean extra columns (and repeat genre columns) from basics
basics = basics.drop(columns = ['originalTitle', 'titleType', 'isAdult', 'genres', 'genres_split'])

### Create Table

In [11]:
# Check Datatypes for Schema
basics.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [12]:
# Find length of object types
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

# Create schema
basics_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    "startYear":Float(),
    "endYear":Float(),
    "runtimeMinutes": Integer()}

In [13]:
# Create title_basics table
basics.to_sql('title_basics', engine, dtype=basics_schema,
              if_exists = 'replace', index = False)

In [14]:
# Set Primary Key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [15]:
# Check table
q = '''
SELECT *
FROM title_basics
LIMIT 5; '''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0093119,Grizzly II: Revenge,2020.0,None,74

## title_ratings

### Read In and Inspect Data

In [16]:
ratings = pd.read_csv("data/title_ratings.csv.gz")

display(ratings.head(2))

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248

In [17]:
# Check Datatypes for Schema
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

### Create Table

In [18]:
# Find length of object types
key_len = basics['tconst'].fillna('').map(len).max()

# Create Schema
ratings_schema = {
    "tconst": String(key_len+1),
    "averageRating":Float(),
    "numVotes": Integer()}

In [19]:
# Create title_ratings table
ratings.to_sql('title_ratings', engine, dtype=ratings_schema,
               if_exists='replace', index=False)

In [20]:
# Set Primary Key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [21]:
# Check table
q = '''
SELECT *
FROM title_ratings
LIMIT 5; '''
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

## title_genres

In [22]:
# Use exploded_genres generated earlier to create cross table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop(columns = 'genres_split', inplace = True)
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

### Create Table

In [23]:
# Check Datatypes for Schema
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [24]:
# Find length of object types
key_len = title_genres['tconst'].fillna('').map(len).max()

# Create Schema
title_genres_schema = {
    "tconst": String(key_len+1),
    "genre_id": Integer() }

In [25]:
# Create title_genres table
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema,
                   if_exists='replace', index=False)

In [26]:
# Check table
q = '''
SELECT *
FROM title_genres
LIMIT 5; '''
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

## genres

### Create DataFrame

In [27]:
# Turn mapping dictionary into a Dataframe
genres = pd.DataFrame({'genre_name': genre_map.keys(), 'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Create Table

In [28]:
# Check Datatypes for Schema
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

In [29]:
# Find length of object types
name_len = genres['genre_name'].fillna('').map(len).max()

# Create Schema
genres_schema = {
    "genre_name": Text(name_len+1),
    "genre_id": Integer() }

In [30]:
# Create genres table
genres.to_sql('genres', engine, dtype=genres_schema,
              if_exists='replace', index=False)

In [31]:
# Set Primary Key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`)')

In [32]:
# Check table
q = '''
SELECT *
FROM genres
LIMIT 5; '''
pd.read_sql(q,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## tmdb_data

### Read In and Inspect Data

In [33]:
tmdb_data = pd.read_csv('data/tmdb_merged.csv.gz')

tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,0,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
1,tt0113092,0.0,NaN,0,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
2,tt0116391,0.0,NaN,0,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
3,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,0,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1860.0,PG
4,tt0118852,0.0,NaN,0,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.9,45.0,R

Column Selection for our database:
- title, adult, genres, runtime, and release_date already exist within the IMDB database
- popularity metrics (vote_average, vote_count, and popularity) are also captured by IMDB in their own metrics.
- backgrop_path, homepage, tagline, poster_path original_title, video, overview, original and spoken languages, and id are not useful for our database based on our stakeholder's desired interests.

We are dropping production companies and production countries from this list but will revisit those in a different table.

In [34]:
## Grab columns we want for the database
drop_list=['adult', 'runtime', 'genres', 'release_date', 'title', 'vote_count', 
           'vote_average', 'popularity', 'backdrop_path', 'homepage', 'tagline',
           'poster_path', 'original_title', 'id', 'video', 'overview', 
           'original_language', 'spoken_languages', 'production_companies', 
          'production_countries']
tmdb_data = tmdb_data.drop(columns = drop_list)

# change imdb_id to tconst to match the other tables
tmdb_data = tmdb_data.rename(columns = {'imdb_id':'tconst'})

### Create Table

In [35]:
# Check Datatypes for Schema
tmdb_data.dtypes

tconst                    object
belongs_to_collection      int64
budget                   float64
revenue                  float64
status                    object
certification             object
dtype: object

In [36]:
# Find length of object types
key_len = tmdb_data['tconst'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
status_len = tmdb_data['status'].fillna('').map(len).max()

# Create Schema
tmdb_schema = {
    'tconst': String(key_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification': Text(cert_len+1),
    'status': Text(status_len+1),
    'belongs_to_collection': Float()}

In [37]:
# Create tmdb_table
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_schema,
                 if_exists='replace', index=False)

In [38]:
# Set Primary Key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`tconst`);')

In [39]:
# Check table
q = '''
SELECT *
FROM tmdb_data
LIMIT 5; '''
pd.read_sql(q,engine)

,tconst,belongs_to_collection,budget,revenue,status,certification
0,tt0035423,0.0,48000000.0,76019000.0,Released,PG-13
1,tt0062336,0.0,0.0,0.0,Released,None
2,tt0069049,0.0,12000000.0,0.0,Released,R
3,tt0088751,0.0,350000.0,0.0,Released,None
4,tt0093119,1.0,7500000.0,0.0,Released,None

## title_prodco

### Normalize Production Companies

In [40]:
title_prodco = pd.read_csv('data/tmdb_merged.csv.gz')
title_prodco = title_prodco.rename(columns = {'imdb_id':'tconst'})
title_prodco.head(2)

,tconst,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,0,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
1,tt0113092,0.0,NaN,0,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN

In [41]:
# title_prodco = 
title_prodco = title_prodco[['tconst', 'production_companies']]

In [42]:
test = title_prodco['production_companies'][0]

In [43]:
import re
exp= r"(?:\'name\'\:.\'(\w*.*?)\')"
re.findall(exp, test)

['Sullivan Street Productions',
 'Michael Ritchie Productions',
 'Radmin Company, The',
 'United Artists']

In [44]:
def get_prod_company_names(x):
    if x=='[]':
        return ["MISSING"]
    
    exp= r"\'name\'\:.?\'(\w*.*?)\'"
    companies = re.findall(exp, x)
    return companies

get_prod_company_names(test)

['Sullivan Street Productions',
 'Michael Ritchie Productions',
 'Radmin Company, The',
 'United Artists']

In [45]:
title_prodco['prod_company'] = title_prodco['production_companies'].apply(get_prod_company_names)
title_prodco.head(2)

,tconst,production_companies,prod_company
0,tt0113026,"[{'id': 51207, 'logo_path': None, 'name': 'Sul...","[Sullivan Street Productions, Michael Ritchie ..."
1,tt0113092,"[{'id': 7405, 'logo_path': '/rfnws0uY8rsNAsrLb...","[Dimension Films, Grand Design Entertainment, ..."

In [46]:
exploded_prodco = title_prodco.explode('prod_company')
exploded_prodco = exploded_prodco.dropna()

unique_prodco = exploded_prodco['prod_company'].unique()

In [47]:
prodco_ints = range(len(unique_prodco))
prodco_map = dict(zip(unique_prodco, prodco_ints))

In [48]:
# Use exploded_genres generated earlier to create cross table
title_prodco = exploded_prodco[['tconst', 'prod_company']].copy()
title_prodco['prodco_id'] = title_prodco['prod_company'].map(prodco_map)
title_prodco.drop(columns = 'prod_company', inplace = True)
title_prodco.head()

      tconst  prodco_id
0  tt0113026          0
0  tt0113026          1
0  tt0113026          2
0  tt0113026          3
1  tt0113092          4

### Create Table

In [49]:
title_prodco.dtypes

tconst       object
prodco_id     int64
dtype: object

In [50]:
key_len = title_prodco['tconst'].fillna('').map(len).max()

# Create Schema
title_prodco_schema = {
    "tconst": String(key_len+1),
    "prodco_id": Integer()}

In [51]:
# Create title_genres table
title_prodco.to_sql('title_prodco', engine, dtype=title_prodco_schema,
                   if_exists='replace', index=False)

In [52]:
# Check Table 
q = '''
SELECT *
FROM title_prodco
LIMIT 5; '''

pd.read_sql(q, engine)

      tconst  prodco_id
0  tt0113026          0
1  tt0113026          1
2  tt0113026          2
3  tt0113026          3
4  tt0113092          4

## prod_companies

### Create DataFrame

In [53]:
# Turn mapping dictionary into a Dataframe
prodco = pd.DataFrame({'product_company': prodco_map.keys(), 'prodco_id': prodco_map.values()})
prodco.head()

Empty DataFrame
Columns: [product_company, prodco_id]
Index: []

### Create Table

In [54]:
prodco.dtypes

product_company    object
prodco_id           int64
dtype: object

In [55]:
prodco_len = prodco['product_company'].fillna('').map(len).max()

# Create Schema
prodco_schema = {
    "product_company": Text(prodco_len+1),
    "prodco_id": Integer()
}

In [56]:
prodco.to_sql('prodco', engine, dtype=prodco_schema, 
              if_exists='replace', index = False)

In [57]:
engine.execute('ALTER TABLE prodco ADD PRIMARY KEY (`prodco_id`)')

In [58]:
q = '''
SELECT *
FROM prodco
LIMIT 5; '''
pd.read_sql(q,engine)

               product_company  prodco_id
0  Sullivan Street Productions          0
1  Michael Ritchie Productions          1
2          Radmin Company, The          2
3               United Artists          3
4              Dimension Films          4

# Tables Check

In [61]:
# Check that all 5 tables have been loaded in properly
q = ''' SHOW TABLES'''

pd.read_sql(q,engine)

  Tables_in_moviedb
0            genres
1            prodco
2      title_basics
3      title_genres
4      title_prodco
5     title_ratings
6         tmdb_data